Ran into the same thing...

 Terraform crashes.

### Terraform Version
```
terraform -v
Terraform v0.13.5
+ provider registry.terraform.io/-/aws v3.14.1
+ provider registry.terraform.io/-/local v2.0.0
+ provider registry.terraform.io/-/rabbitmq v1.4.0
+ provider registry.terraform.io/-/random v3.0.0
+ provider registry.terraform.io/hashicorp/aws v3.14.1
+ provider registry.terraform.io/hashicorp/kubernetes v1.13.3
+ provider registry.terraform.io/hashicorp/local v2.0.0
+ provider registry.terraform.io/hashicorp/null v3.0.0
+ provider registry.terraform.io/hashicorp/random v3.0.0
+ provider registry.terraform.io/terraform-providers/rabbitmq v1.4.0
+ provider registry.terraform.io/wgebis/mailgun v0.5.2
```
### Affected Resource(s)

### Debug Output
```
module.development.module.<**redacted**>.data.aws_route53_zone.selected: Refreshing state... [id=Z1YZA2GL8AQTKD]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.development.module.<**redacted**>.aws_route53_record.mailgun_receiving_records_mx will be created
  + resource "aws_route53_record" "mailgun_receiving_records_mx" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + records         = (known after apply)
      + ttl             = 300
      + type            = "MX"
      + zone_id         = "<**redacted**>"
    }

  # module.development.module.<**redacted**>.aws_route53_record.mailgun_sending_record_0 will be created
  + resource "aws_route53_record" "mailgun_sending_record_0" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 300
      + type            = (known after apply)
      + zone_id         = "<**redacted**>"
    }

  # module.development.module.<**redacted**>.aws_route53_record.mailgun_sending_record_1 will be created
  + resource "aws_route53_record" "mailgun_sending_record_1" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 300
      + type            = (known after apply)
      + zone_id         = "<**redacted**>"
    }

  # module.development.module.<**redacted**>.aws_route53_record.mailgun_sending_record_2 will be created
  + resource "aws_route53_record" "mailgun_sending_record_2" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 300
      + type            = (known after apply)
      + zone_id         = "<**redacted**>"
    }

  # module.development.module.<**redacted**>.mailgun_domain.new will be created
  + resource "mailgun_domain" "new" {
      + id                = (known after apply)
      + name              = "<**redacted**>"
      + receiving_records = (known after apply)
      + region            = "us"
      + sending_records   = (known after apply)
      + smtp_login        = (known after apply)
      + smtp_password     = (known after apply)
      + wildcard          = true
    }
```
 ### Panic Output

https://gist.github.com/nerd0/5c09bfec9f3c787c0c17eab0d651ca63

### Expected Behavior
 
Mailgun domain created and route53 records created

### Actual Behavior
 
 Terraform crashes.

### Steps to Reproduce
 
Create Terraform configuration with above content and apply with `-target=`

### Important Factoids

### References
